// Урок 1. Знакомство с JavaScript 
// Задание 1 

// Необходимо создать переменную в которой будет храниться температура в градусах Цельсия, преобразовать значение в температуру по фаренгейту. Формула перевода градусов Цельсия в градусы Фаренгейта: градусы Фаренгейта
// = (9 / 5) * градусы Цельсия + 32 

// Вывести в консоль температуру в Цельсиях и Фаренгейтах. 

// Задание 2 

// Необходимо создать переменную name, записать в эту переменную свое имя. Необходимо также создать переменную 
// admin и присвоить этой переменной 

// значение из переменной name. Вывести значение переменной admin в консоль./*


var C = 34;
let F = (9 / 5) * C + 32;
//var result = 0;
//result = prompt('Введите температуру :', 36);
//let a = Number(prompt('Введите первое число'));
console.log('Температура в Цельсиях: ', C);
console.log('Температура в Фаренгейтах: ', F);

const name = 'Peter';
var admin = name;

console.log('admin = ', admin);